Exercise 10

Արտահայտել մեկ փոփոխականը մյուսով

Solution 10

var a = 5;
var b = 10;
var y = a; /*Այսինքն ստեղծեցինք մի նոր y, որը հավասար է 5*/
a = b; /*Սրանով մենք a-ն սարքեցինք 10*/
b = y; /*դե վերևն էլ արդեն մի հատ առանձին սիրուն y ունեինք պահած որը հավասարացրել էինք 5-ի, դա վերագրենք b-ին*/
console.log(a)
console.log(b)

կամ առանց երրորդ փոփոխական հայտարարելու:

var a = 10;
var b = 5;

a = a + b; /*a-ն եղավ 15*/
b = a - b; /*b -ն եղավ 10*/
a = a - b; /*ա-ն եղավ 5*/

Եվ իհարկե՝ քո լուծածը ^^
  
var a = 5;
var b = 10;
var x = b;
var b = a;
var a = x;
console.log(a);
console.log(b);